/**
 * Напишите функцию capitalize(input), которая принимает строку input
 * и возвращает её копию, где каждое слово начинается с заглавной буквы.
 * - "Слово" — последовательность юникод-символов из группы "letters".
 * - Слова с дефисами (например, "что-то") считаются одним словом.
 * Input: 'что-то произошло'
 * Output: 'Что-то Произошло'
 */

function capitalize(input) {
    // your code
}

console.log(capitalize('что-то произошло'))  // 'Что-то Произошло'
console.log(capitalize('foo bar baz'))        // 'Foo Bar Baz'
